benchmarks/suites/thumbnail-generator/artillery/test-ec2.yml
config:
  target: "https://REPLACE_ME"
  processor: "./upload-image.js"

  # ============================================================
  # Load test phases for the thumbnail generator. Identical across platforms:
  # - EC2: c6i.large host, container capped at 1 vCPU / 1024 MB
  # - ECS: task 1024 CPU units (1 vCPU) / 1024 MB on a c6i.large
  # - Lambda: 1769 MB (one full vCPU), reserved concurrency 1
  # Every platform serves with exactly one 1-vCPU worker.
  # ============================================================
  phases:
  # arrivalCount, not arrivalRate: arrivalRate starts N users on the same
  # instant, which one Lambda sandbox cannot absorb. csv-processor at 12 req/s
  # saw 234 HTTP 502s with arrivalRate, 3 with arrivalCount.
  # One request per arrival, so arrivals == requests.

    # Warm-up at the primary rate; warming lower leaves the step transient
    # inside the reported window. Discarded.
    - duration: 180
      arrivalCount: 2520

    # Probe, 4 req/s - 13% of Lambda's ceiling, 5% of EC2/ECS.
    - duration: 360
      arrivalCount: 1440

    # Probe, 8 req/s - 26% / 11%.
    - duration: 360
      arrivalCount: 2880

    # Primary, 14 req/s - 46% of Lambda's ceiling, 19% of EC2/ECS.
    # Every reported latency figure comes from here; ~10000 requests.
    - duration: 720
      arrivalCount: 10080

    # Probe, 20 req/s - 66%, the closest approach to the knee. Throttling
    # here is a result, not a misconfiguration; report it.
    - duration: 360
      arrivalCount: 7200

  defaults:
    headers:
      Host: thumb-ec2.bench.local
    http:
      timeout: 60

  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "http://localhost:9293"
        testName: "thumbnail-load-test"
        environment: "production"
        labels:
          service: "thumbnail-service"
          scenario: "upload-formdata"
          instance: ec2

# ============================================================
# Scenarios
# ============================================================
scenarios:
  - name: Upload de imagem via form-data manual
    flow:
      - post:
          url: "/thumbnail?width=200&height=400&format=jpg&quality=80"
          beforeRequest: "buildFormData"