benchmarks/suites/thumbnail-generator/artillery/test-lambda.yml
config:
  target: "https://REPLACE_ME"
  processor: "./upload-image.js"

  # ============================================================
  # Load test phases for the thumbnail generator. Identical across platforms:
  # - EC2: c6i.large host, container capped at 1 vCPU / 1024 MB
  # - ECS: task 1024 CPU units (1 vCPU) / 1024 MB on a c6i.large
  # - Lambda: 1769 MB (one full vCPU), reserved concurrency 1
  # Every platform serves with exactly one 1-vCPU worker.
  # ============================================================
  phases:
  # Derived from a workstation measurement of this fixture, 2026-08-06: 77.6 ms
  # mean in-app, n=719. The 1.354x csv-processor factor puts it near 57 ms on
  # c6i, so EC2/ECS cap near 17 req/s and Lambda near 7, the lower of the
  # multiplicative and additive models. Not a pilot: run make pilot-thumbnail
  # and re-derive before publishing.
  #
  # arrivalCount, not arrivalRate: a rate starts every virtual user of a second
  # at the same instant. One request per arrival, so arrivals == requests.

    # Warm-up at the primary rate. Discarded.
    - duration: 180
      arrivalCount: 540

    # Probe, 1 req/s - 14% of Lambda's ceiling, 6% of EC2/ECS.
    - duration: 360
      arrivalCount: 360

    # Probe, 2 req/s - 29% / 12%.
    - duration: 360
      arrivalCount: 720

    # Primary, 3 req/s - 43% / 18%. Source of every reported figure.
    - duration: 720
      arrivalCount: 2160

    # Probe, 5 req/s - 71% / 29%. Throttling here is a result, report it.
    - duration: 360
      arrivalCount: 1800

  defaults:
    headers:
      Host: thumb-lambda.bench.local
    http:
      timeout: 60

  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "http://localhost:9294"
        testName: "thumbnail-load-test"
        environment: "production"
        labels:
          service: "thumbnail-service"
          scenario: "upload-formdata"
          instance: lambda

# ============================================================
# Scenarios
# ============================================================
scenarios:
  - name: Upload de imagem via form-data manual
    flow:
      - post:
          url: "/thumbnail?width=200&height=400&format=jpg&quality=80"
          beforeRequest: "buildFormData"